Repository: xuanmanh-2110/2025_LTTBDD_N04_NguyenXuanManh
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Welcome!
vi: Chào mừng bạn!

# welcomeSubtitle
source: Start your health journey today
vi: Hãy bắt đầu hành trình sức khỏe của bạn

# personalInfo
source: Personal Information
vi: Thông tin cá nhân

source: Full Name
vi: Họ và tên

# height
source: Height (cm)
vi: Chiều cao (cm)

# weight
source: Weight (kg)
vi: Cân nặng (kg)

# heightLabel
source: Height
vi: Chiều cao

# weightLabel
source: Weight
vi: Cân nặng

source: Get Started
vi: Bắt đầu ngay

source: Journal
vi: Nhật ký

source: About
vi: Thông tin

source: Personal
vi: Cá nhân

# todayJournal
source: Today's Journal
vi: Nhật ký hôm nay

source: Total Calories Needed
vi: Tổng kcal cần nạp

source: Consumed
vi: Đã nạp

source: Macro Nutrients
vi: Macro dinh dưỡng

# intro1Title
source: Track Calories Easily
vi: Theo dõi calo dễ dàng

# intro1Desc
source: Record and manage your daily calories simply
vi: Ghi nhận và quản lý lượng calo hàng ngày một cách đơn giản

# intro2Title
source: Reach Your Goals
vi: Đạt mục tiêu của bạn

# intro2Desc
source: Monitor progress and achieve your health goals
vi: Theo dõi tiến trình và đạt được mục tiêu sức khỏe

# intro3Title
source: Maintain Healthy Lifestyle
vi: Duy trì lối sống lành mạnh

# intro3Desc
source: Track water intake and nutrition every day
vi: Theo dõi nước uống và dinh dưỡng mỗi ngày

source: Next
vi: Tiếp

source: Skip
vi: Bỏ qua

source: Done
vi: Hoàn thành

# errorEmptyName
source: Please enter your name
vi: Vui lòng nhập họ và tên

# errorEmptyHeight
source: Please enter your height
vi: Vui lòng nhập chiều cao

# errorInvalidHeight
source: Invalid height
vi: Chiều cao không hợp lệ

# errorEmptyWeight
source: Please enter your weight
vi: Vui lòng nhập cân nặng

# errorInvalidWeight
source: Invalid weight
vi: Cân nặng không hợp lệ

# errorEmptyEmail
source: Please enter your email
vi: Vui lòng nhập email

# errorInvalidEmail
source: Invalid email
vi: Email không hợp lệ

# errorEmptyPassword
source: Please enter your password
vi: Vui lòng nhập mật khẩu

# errorPasswordTooShort
source: Password must be at least 6 characters
vi: Mật khẩu phải có ít nhất 6 ký tự

# errorPasswordNotMatch
source: Passwords do not match
vi: Mật khẩu không khớp

source: Age
vi: Tuổi

source: Age (years)
vi: Tuổi (năm)

source: Gender
vi: Giới tính

source: Male
vi: Nam

source: Female
vi: Nữ

source: Your Goal
vi: Mục tiêu của bạn

source: Lose Weight
vi: Giảm cân

# loseWeightDesc
source: Lose 0.5 kg per week
vi: Giảm 0.5 kg mỗi tuần

source: Maintain Weight
vi: Duy trì cân nặng

# maintainWeightDesc
source: Keep current weight
vi: Giữ nguyên cân nặng

source: Gain Weight
vi: Tăng cân

# gainWeightDesc
source: Gain 0.5 kg per week
vi: Tăng 0.5 kg mỗi tuần

source: Activity Level
vi: Mức độ hoạt động

source: Sedentary
vi: Ít vận động

# sedentaryDesc
source: Little or no exercise
vi: Ít hoặc không tập thể dục

source: Lightly Active
vi: Vận động nhẹ

# lightlyActiveDesc
source: Light exercise 1-3 days/week
vi: Tập nhẹ 1-3 ngày/tuần

source: Moderately Active
vi: Vận động vừa

# moderatelyActiveDesc
source: Moderate exercise 3-5 days/week
vi: Tập vừa 3-5 ngày/tuần

source: Very Active
vi: Vận động nhiều

# veryActiveDesc
source: Hard exercise 6-7 days/week
vi: Tập nặng 6-7 ngày/tuần

source: Extra Active
vi: Vận động cực nhiều

# extraActiveDesc
source: Very hard exercise & physical job
vi: Tập rất nặng & công việc nặng nhọc

# errorEmptyAge
source: Please enter your age
vi: Vui lòng nhập tuổi

# errorInvalidAge
source: Invalid age
vi: Tuổi không hợp lệ

# errorSelectGender
source: Please select your gender
vi: Vui lòng chọn giới tính

# errorSelectGoal
source: Please select your goal
vi: Vui lòng chọn mục tiêu

# errorSelectActivity
source: Please select your activity level
vi: Vui lòng chọn mức độ hoạt động

source: Add Food
vi: Thêm món ăn

source: Breakfast
vi: Bữa sáng

source: Lunch
vi: Bữa trưa

source: Dinner
vi: Bữa tối

source: Add Meal
vi: Thêm món

source: About Project
vi: Về dự án

# aboutProjectDesc
source: Calorie Tracker is a comprehensive health management application that helps you track your daily calorie intake, water consumption, and BMI index. The app is designed with a user-friendly interface and provides personalized features to help you achieve your health goals.
vi: Ứng dụng Calorie Tracker là một công cụ quản lý sức khỏe toàn diện, giúp bạn theo dõi lượng calo hàng ngày, lượng nước uống, và chỉ số BMI. Ứng dụng được thiết kế với giao diện thân thiện, dễ sử dụng và cung cấp các tính năng cá nhân hóa để giúp bạn đạt được mục tiêu sức khỏe của mình.

source: Personalized Goals
vi: Mục tiêu cá nhân hóa

source: Main Features
vi: Tính năng chính

source: Track Calories
vi: Theo dõi calo

# trackCaloriesDesc
source: Record and calculate your daily calorie intake
vi: Ghi nhận và tính toán lượng calo nạp vào

source: Water Reminder
vi: Nhắc uống nước

# waterReminderDesc
source: Track your daily water intake
vi: Theo dõi lượng nước uống hàng ngày

source: Calculate BMI
vi: Tính BMI

# calculateBMIDesc
source: Monitor your BMI and health status
vi: Theo dõi chỉ số BMI và sức khỏe

# personalizedGoalsDesc
source: Set and track calorie goals based on your personal information
vi: Thiết lập và theo dõi mục tiêu calo dựa trên thông tin cá nhân

source: Developer
vi: Nhà phát triển

source: Name
vi: Họ và tên

source: Student ID
vi: Mã sinh viên

# className
source: Class
vi: Lớp

source: University
vi: Trường

# universityName
source: Phenikaa University
vi: Đại học Phenikaa

# techStack
source: Technology Stack
vi: Công nghệ sử dụng

source: Local Data Storage
vi: Lưu trữ dữ liệu cục bộ

source: Typography
vi: Font chữ

source: UI Framework
vi: Khung giao diện

# updateWeightTitle
source: Update Weight
vi: Cập nhật cân nặng

# updateWaterGoalTitle
source: Update Water Goal
vi: Cập nhật mục tiêu nước

# waterGoalLabel
source: Water Goal (ml)
vi: Mục tiêu nước (ml)

source: Last Updated
vi: Lần cuối cập nhật

source: Your BMI
vi: BMI của bạn

source: Update Weight
vi: Cập nhật cân nặng

source: Water Goal
vi: Mục tiêu nước

# shouldDrinkDaily
source: Daily Recommendation
vi: Nên uống mỗi ngày

source: Customize Goal
vi: Tùy chỉnh mục tiêu
